
#+latex_header: \usepackage[normalem]{ulem}
#+latex_header: \usepackage{todonotes}
#+latex_header: \usepackage[usenames, dvipsnames]{color}

#+latex_header: \newcommand\cmred{\bgroup\markoverwith{\textcolor{red}{\rule[0.5ex]{4pt}{1.4pt}}}\ULon}
#+latex_header: \newcommand\cmblue{\bgroup\markoverwith{\textcolor{blue}{\rule[-0.5ex]{4pt}{1.4pt}}}\ULon}

#+LATEX_CLASS: no-article
#+LATEX_CLASS_OPTIONS: [12pt]
#+TITLE: Neural Network and ReaxFF comparison for Au properties

#+latex_header: \setlength{\oddsidemargin}{0in}
#+latex_header: \setlength{\textwidth}{6.5in}
#+latex_header: \setlength{\topmargin}{-0.5in}
#+latex_header: \setlength{\textheight}{9in}

#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{textcomp}
#+latex_header: \usepackage{underscore}
#+latex_header: \usepackage{graphicx}
#+latex_header: \usepackage{caption}
#+latex_header: \usepackage{color}
#+latex_header: \usepackage{dcolumn}
#+latex_header: \usepackage{bm}
#+latex_header: \usepackage{authblk}
#+latex_header: \usepackage[numbers,super,comma,sort&compress]{natbib}
#+latex_header: \usepackage{natmove}
#+latex_header: \usepackage[linktocpage,pdfstartview=FitH,colorlinks,
#+latex_header: linkcolor=blue,anchorcolor=blue,
#+latex_header: citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
#+latex_header: \usepackage{float}
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: author:nil date:nil ^:{} toc:nil

#+latex_header: \author[1]{Jacob R. Boes}
#+latex_header: \author[2]{Mitchell C. Groenenboom}
#+latex_header: \author[2]{John A. Keith\thanks{jakeith@pitt.edu}}
#+latex_header: \author[1]{John R. Kitchin\thanks{jkitchin@andrew.cmu.edu}}
#+latex_header: \affil[1]{Department of Chemical Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA}
#+latex_header: \affil[2]{Department of Chemical and Petroleum Engineering, University of Pittsburgh, Benedum Hall, 3700 O'Hara Street, Pittsburgh, PA 15261, USA}

* Build								   :noexport:


@@latex:\protect\cmblue{This generates the revisions between the current and submitted manuscript.
#+BEGIN_SRC emacs-lisp
(cm-wdiff-to-pdf '("HEAD" "submitted"))
#+END_SRC

#+RESULTS:
: t}@@


#+BEGIN_SRC emacs-lisp
(ox-manuscript-build-submission-manuscript)

(ox-manuscript-make-submission-archive nil nil nil nil nil
"images/toc.png" @@latex:\protect\cmblue{"manuscript-toc.tex" "manuscript-revised.pdf"}@@ "supporting-information.pdf")

@@latex:\protect\cmred{(loop for png in (f-entries "manuscript-2015-12-21" (lambda (f) (f-ext? f "png")))
      do
      (shell-command (format
		      "convert %s %s"
		      png
		      (replace-regexp-in-string "\.png$" ".eps" png))))}@@
#+END_SRC

#+RESULTS:
@@latex:\protect\cmblue{: manuscript-2016-01-24/}@@
